/**
 * 问题描述 :

输入年和月，输出该月有几天。

输入说明 :

输入两个整数，中间以空格分隔，第一个整数表示年，第二个整数表示月。

输出说明 :

输出该年该月的天数，输出时，行首与行尾均无空格，仅输出一个整数。


*/
#include <iostream>
using namespace std;

int main(void)
{
    int y, m, d; // 年，月，日
    cin >> y >> m;
    if ((y % 4 == 0 && y % 100 != 0) || y % 400 == 0) //闰年,2月有29天
    {
        if (m == 2)

            d = 29;

        else if (m == 1 || m == 3 || m == 5 || m == 7 || m == 8 || m == 10 || m == 12)

            d = 31;
        else
            d = 30;
    }
    else // 平年
    {
        if (m == 2)

            d = 28;

        else if (m == 1 || m == 3 || m == 5 || m == 7 || m == 8 || m == 10 || m == 12)

            d = 31;
        else
            d = 30;
    }
    cout << d;
}